tutorials/compressible/steadyCompressibleMRFFoam/simpleRotorStator/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    bladeRotor
    {
        type            compressible::epsilonWallFunction;
        value           $internalField;
    }
    shaftRotor
    {
        type            compressible::epsilonWallFunction;
        value           $internalField;
    }
    shroudRotor
    {
        type            compressible::epsilonWallFunction;
        value           $internalField;
    }
    bladeStator
    {
        type            compressible::epsilonWallFunction;
        value           $internalField;
    }
    shaftStator
    {
        type            compressible::epsilonWallFunction;
        value           $internalField;
    }
    shroudStator
    {
        type            compressible::epsilonWallFunction;
        value           $internalField;
    }
    frontAndBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
